local-MyRocks/raw/res.mysql56.PK/res.thr630.ro.txt
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 630
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[  10s] threads: 630, tps: 0.00, reads: 396010.00, writes: 0.00, response time: 10.19ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 630, tps: 0.00, reads: 394462.39, writes: 0.00, response time: 9.90ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 630, tps: 0.00, reads: 394209.84, writes: 0.00, response time: 9.96ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 630, tps: 0.00, reads: 393911.98, writes: 0.00, response time: 9.96ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 630, tps: 0.00, reads: 393411.95, writes: 0.00, response time: 9.59ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 630, tps: 0.00, reads: 393499.80, writes: 0.00, response time: 9.76ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 630, tps: 0.00, reads: 394899.37, writes: 0.00, response time: 10.01ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 630, tps: 0.00, reads: 394148.28, writes: 0.00, response time: 9.99ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 630, tps: 0.00, reads: 392010.06, writes: 0.00, response time: 10.04ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 630, tps: 0.00, reads: 393169.50, writes: 0.00, response time: 10.09ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 630, tps: 0.00, reads: 392942.26, writes: 0.00, response time: 10.06ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 630, tps: 0.00, reads: 393422.58, writes: 0.00, response time: 9.71ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 630, tps: 0.00, reads: 393321.71, writes: 0.00, response time: 9.84ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 630, tps: 0.00, reads: 392296.90, writes: 0.00, response time: 9.88ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 630, tps: 0.00, reads: 392028.11, writes: 0.00, response time: 9.97ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 630, tps: 0.00, reads: 395263.84, writes: 0.00, response time: 10.00ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 630, tps: 0.00, reads: 393061.33, writes: 0.00, response time: 9.78ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 630, tps: 0.00, reads: 392463.86, writes: 0.00, response time: 10.10ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 630, tps: 0.00, reads: 393167.84, writes: 0.00, response time: 9.77ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 630, tps: 0.00, reads: 393011.11, writes: 0.00, response time: 10.02ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 630, tps: 0.00, reads: 393892.55, writes: 0.00, response time: 10.03ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 630, tps: 0.00, reads: 392576.37, writes: 0.00, response time: 9.61ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 630, tps: 0.00, reads: 393758.63, writes: 0.00, response time: 9.95ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 630, tps: 0.00, reads: 394219.23, writes: 0.00, response time: 9.86ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 630, tps: 0.00, reads: 393577.99, writes: 0.00, response time: 9.82ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 630, tps: 0.00, reads: 393251.59, writes: 0.00, response time: 9.93ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 630, tps: 0.00, reads: 393579.07, writes: 0.00, response time: 10.11ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 630, tps: 0.00, reads: 392475.24, writes: 0.00, response time: 10.16ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 630, tps: 0.00, reads: 394270.33, writes: 0.00, response time: 9.77ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            118070124
        write:                           0
        other:                           0
        total:                           118070124
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 118070124 (393562.85 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0032s
    total number of events:              118070124
    total time taken by event execution: 188684.5353s
    response time:
         min:                                  0.05ms
         avg:                                  1.60ms
         max:                                238.72ms
         approx.  95 percentile:               9.94ms

Threads fairness:
    events (avg/stddev):           187412.8952/1370.64
    execution time (avg/stddev):   299.4993/0.02